hpu339/STM32/7.1DMA数据转运/User/main.c
/*
 * @Author: Yang Lixin
 * @Date: 2023-02-08 23:22:36
 * @LastEditors: [you name]
 * @LastEditTime: 2023-02-10 18:10:55
 * @Description:
 */

#include "stm32f10x.h"                  // Device header
#include "OLED.h"
#include "Delay.h"
#include "DMA.h"


uint8_t DataA[] = {0x01,0x02,0x03,0x04};//16位，也就是2Byte，一共8个字节
uint8_t DataB[] = {0,0,0,0};
int main(void)
{
	OLED_Init();
	DMA1_Init((uint32_t)DataA,(uint32_t)DataB,4); //s
	OLED_ShowString(1, 1, "DataA");
	OLED_ShowString(3, 1, "DataB");
	OLED_ShowHexNum(1, 8, (uint32_t)DataA, 8);
	OLED_ShowHexNum(3, 8, (uint32_t)DataB, 8);
	while(1)
	{
		DataA[0] ++;
		DataA[1] ++;
		DataA[2] ++;
		DataA[3] ++;
		
		OLED_ShowHexNum(2, 1, DataA[0], 2);
		OLED_ShowHexNum(2, 4, DataA[1], 2);
		OLED_ShowHexNum(2, 7, DataA[2], 2);
		OLED_ShowHexNum(2, 10, DataA[3], 2);
		OLED_ShowHexNum(4, 1, DataB[0], 2);
		OLED_ShowHexNum(4, 4, DataB[1], 2);
		OLED_ShowHexNum(4, 7, DataB[2], 2);
		OLED_ShowHexNum(4, 10, DataB[3], 2);
		
		Delay_ms(1000);
		
		DMA1_Tranfer();
		
		OLED_ShowHexNum(2, 1, DataA[0], 2);
		OLED_ShowHexNum(2, 4, DataA[1], 2);
		OLED_ShowHexNum(2, 7, DataA[2], 2);
		OLED_ShowHexNum(2, 10, DataA[3], 2);
		OLED_ShowHexNum(4, 1, DataB[0], 2);
		OLED_ShowHexNum(4, 4, DataB[1], 2);
		OLED_ShowHexNum(4, 7, DataB[2], 2);
		OLED_ShowHexNum(4, 10, DataB[3], 2);

		Delay_ms(1000);
	}
	
}
